---
kind: type
id: T:Autodesk.Revit.DB.CitySetIterator
source: html/fe078250-71c4-6a19-ac0d-6d674b86fac9.htm
---
# Autodesk.Revit.DB.CitySetIterator

An iterator to a city set.

## Syntax (C#)
```csharp
public abstract class CitySetIterator : APIObject,
	IEnumerator
```